foodist/app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.save
---
INSERT INTO "recipes" ("name", "ingredient_list", "user_id", "votes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "chocolate"], ["ingredient_list", "caramel"], ["user_id", 1], ["votes", 0], ["created_at", "2018-04-16 16:55:19.383277"], ["updated_at", "2018-04-16 16:55:19.383277"]]

  def update
    @recipe = Recipe.find(params[:id])
    @recipe.update(recipe_params)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "recipes" SET "instruction_list" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["instruction_list", "{\"ut the cereal in a bowl\",\"Add milk\"}"], ["updated_at", "2018-04-13 15:52:23.916253"], ["id", 3]]

  def destroy
    @recipe = Recipe.find(params[:id])
    @recipe.delete
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 1]]