foodist/app/controllers/users_controller.rb

  def create
    binding.pry
    @newUser = {}
    @newUser[:email] = params[:auth][:email]
    @newUser[:fname] = params[:auth][:fname]
    @newUser[:lname] = params[:auth][:lname]
    @newUser[:password] = params[:auth][:password]
    @newUser[:password_confirmation] = params[:auth][:password_confirmation]

    @user = User.new(@newUser)
    if @user.save
---
INSERT INTO "users" ("fname", "lname", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["fname", "casey"], ["lname", "harding"], ["created_at", "2018-04-13 21:51:21.193020"], ["updated_at", "2018-04-13 21:51:21.193020"]]