foodist/app/controllers/votes_controller.rb

  def create
    @vote = Vote.new(vote_params)
    @vote.save
---
INSERT INTO "votes" ("user_id", "voter_id", "created_at", "updated_at", "up", "down") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["voter_id", 6], ["created_at", "2018-04-15 17:44:52.688858"], ["updated_at", "2018-04-15 17:44:52.688858"], ["up", "t"], ["down", "f"]]

  def update
    @vote = Vote.find(params[:id])
    @vote.update(vote_params)
---
SELECT  "votes".* FROM "votes" WHERE "votes"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "votes" SET "up" = $1, "down" = $2, "updated_at" = $3 WHERE "votes"."id" = $4  [["up", "f"], ["down", "t"], ["updated_at", "2018-04-15 20:20:36.187576"], ["id", 4]]