app/controllers/comment_votes_controller.rb

  def index
    @votes = CommentVote.all
---
SELECT "comment_votes".* FROM "comment_votes"
SELECT "votes".* FROM "votes"

  def create
    @vote = CommentVote.new(vote_params)
    @vote.save
---
INSERT INTO "comment_votes" ("user_id", "voter_id", "up", "down", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["voter_id", 7], ["up", "t"], ["down", "f"], ["created_at", "2018-04-21 19:47:34.632742"], ["updated_at", "2018-04-21 19:47:34.632742"]]

  def update
    @vote = CommentVote.find(params[:id])
    @vote.update(vote_params)
---
SELECT  "comment_votes".* FROM "comment_votes" WHERE "comment_votes"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "comment_votes" SET "up" = $1, "down" = $2, "updated_at" = $3 WHERE "comment_votes"."id" = $4  [["up", "f"], ["down", "t"], ["updated_at", "2018-04-21 21:14:30.213953"], ["id", 1]]
UPDATE "comments" SET "comment_votes" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["comment_votes", -8], ["updated_at", "2018-04-21 21:14:30.211985"], ["id", 8]]