app/controllers/comments_controller.rb

  def index
    @comments = Comment.order(comment_votes: :desc, created_at: :desc)
---
SELECT "comments".* FROM "comments" ORDER BY "comments"."comment_votes" DESC, "comments"."created_at" DESC

  def create
    @comment = Comment.new(comment_params)
    @comment.save
---
INSERT INTO "comments" ("poster_id", "recipe_id", "description", "comment_votes", "previous_comment", "next_comment", "created_at", "updated_at", "title", "poster_email", "poster_name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    @comment = Comment.find(params[:id])
    @comment.update(comment_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "comments" SET "previous_comment" = $1, "next_comment" = $2, "updated_at" = $3 WHERE "comments"."id" = $4  [["previous_comment", 24], ["next_comment", 25], ["updated_at", "2018-04-16 10:27:34.994678"], ["id", 24]]

  def destroy
    @comment = Comment.find(params[:id])
    @comment.delete
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]